"use server";

import dayjs from 'dayjs';
import utc from 'dayjs/plugin/utc';
import timezone from 'dayjs/plugin/timezone';
dayjs.extend(utc);
dayjs.extend(timezone);

export async function mockAction({ file, isPaidMode }: { file: File, isPaidMode: boolean }) {
    const dateStr = dayjs().tz("Asia/Shanghai").format('YYYY-MM-DD');
    console.log("Filename:", file.name, ", Date:", dateStr, ", Paid Mode:", isPaidMode);
    // 模拟后端处理时间
    await new Promise((resolve) => setTimeout(resolve, 1000));

    return {
        table: [
            {
                "序": 1,
                "合同编号": "H177013/291231D",
                "签订日期": "",
                "品名": "梨",
                "产品型号": "5EC68F008EE",
                "数量": 1,
                "单价": 10,
                "小计": 100,
                "总价": 300,
                "票款": "",
                "最终用户名称": "深圳不怕影子斜公司",
                "占": "", "位": "", "空": "", "白": "", "列": "",
                "备注": "英国梨梨",
                "地址": "广东省深圳府龙岗县海航乡南村瑞航路1号翻斗花园中心1幢1111室，牛爷爷13912312345"
            },
            {
                "序": 2,
                "合同编号": "H177013/291231D",
                "签订日期": "",
                "品名": "苹果",
                "产品型号": "6EC68F008EE",
                "数量": 2,
                "单价": 20,
                "小计": 40,
                "总价": 300,
                "票款": "",
                "最终用户名称": "深圳不怕影子斜公司",
                "占": "", "位": "", "空": "", "白": "", "列": "",
                "备注": "不是手机",
                "地址": "广东省深圳府龙岗县海航乡南村瑞航路1号翻斗花园中心1幢1111室，牛爷爷13912312345"
            },
            {
                "序": 3,
                "合同编号": "H177013/291231D",
                "签订日期": "",
                "品名": "伊丽莎白",
                "产品型号": "7EC68F008EE",
                "数量": 3,
                "单价": 30,
                "小计": 90,
                "总价": 300,
                "票款": "",
                "最终用户名称": "深圳不怕影子斜公司",
                "占": "", "位": "", "空": "", "白": "", "列": "",
                "备注": "无",
                "地址": "广东省深圳府龙岗县海航乡南村瑞航路1号翻斗花园中心1幢1111室，牛爷爷13912312345"
            },
            {
                "序": 4,
                "合同编号": "H177013/291231D",
                "签订日期": "",
                "品名": "猫山王榴莲",
                "产品型号": "",
                "数量": 4,
                "单价": 40,
                "小计": 160,
                "总价": 300,
                "票款": "",
                "最终用户名称": "深圳不怕影子斜公司",
                "占": "", "位": "", "空": "", "白": "", "列": "",
                "备注": "",
                "地址": "广东省深圳府龙岗县海航乡南村瑞航路1号翻斗花园中心1幢1111室，牛爷爷13912312345"
            }
        ],
        filename: file.name
    };
}